# # Метакласс по определению – это класс, экземпляром которого является другой класс. Метаклассы позволяют нам настраивать процесс создания класса и частично управлять процессом создания экземпляра класса.
# МЕТАКЛАСС (АНГЛ. METACLASS) — В ОБЪЕКТНО-ОРИЕНТИРОВАННОМ ПРОГРАММИРОВАНИИ ЭТО КЛАСС, ЭКЗЕМПЛЯРЫ КОТОРОГО В СВОЮ ОЧЕРЕДЬ ЯВЛЯЮТСЯ КЛАССАМИ/
# Метапрограммирование в Python основано на новом особом типе классов, которые называются метаклассами. Этот тип класса, вкратце, содержит инструкции о закулисной генерации кода, который вы хотите получить, запуская другой код.

